<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"c5b1e01ae795e9d4ec72b92047bd2713e403e890b08b7c37f89247dee4252800","plan_job_ref":"Job CICD for Splitrr Infra #39 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655969289","plan_out_hash":"6995cf08dad38b7a011a7480e49489df59529feb2840dedb17bf3da41e6432e7","plan_hash":"91a97dfa888d1cfeb5b2243d82fbe7ac70ef34c3e6c27d5dd929dde9bc819fd8","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudfront.data.aws_iam_policy_document.origin will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "origin" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "1"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.cloudfront.data.aws_s3_bucket.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket" "s3" {
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.s3_distribution will be created
+   resource "aws_cloudfront_distribution" "s3_distribution" {
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = false
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Name" = "Cloud Front"
        }
+       tags_all                        = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "Cloud Front"
+           "Project" = "Splitrr"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = false
+           default_ttl            = (known after apply)
+           max_ttl                = (known after apply)
+           min_ttl                = 0
+           target_origin_id       = (known after apply)
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts      = 3
+           connection_timeout       = 10
+           domain_name              = (known after apply)
+           origin_access_control_id = (known after apply)
+           origin_id                = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.s3_distribution will be created
+   resource "aws_cloudfront_origin_access_control" "s3_distribution" {
+       description                       = "OAC setup for S3_OAC"
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       name                              = "CLOUDFRONT-OAC"
+       origin_access_control_origin_type = "s3"
+       signing_behavior                  = "always"
+       signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_s3_bucket_policy.origin will be created
+   resource "aws_s3_bucket_policy" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.s3.aws_s3_bucket.default will be created
+   resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "spiltrr-dev-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Name" = "spiltrr-dev-bucket"
        }
+       tags_all                    = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "spiltrr-dev-bucket"
+           "Project" = "Splitrr"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #39](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655969289)